In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series([1., 2., 3.])

0    1.0
1    2.0
2    3.0
dtype: float64

In [3]:
pd.Series([1,2,np.nan])

0    1.0
1    2.0
2    NaN
dtype: float64

In [4]:
## Numpy to pandas
h = [[1,2],[3,4]]
df_h = pd.DataFrame(h)
print('Data Frame:\n', df_h)
dict = {'Name': ["Alice", "Bob"], 'Age': [30, 40]}
df_dict = pd.DataFrame(data=dict)
print('Data Frame:\n', df_dict)

Data Frame:
    0  1
0  1  2
1  3  4
Data Frame:
     Name  Age
0  Alice   30
1    Bob   40

In [5]:
## Create date
# Days
dates_d = pd.date_range('20200101', periods=6, freq='D')
print('Generating 6 dates:', dates_d)

Generating 6 dates: DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
random = np.random.randn(6,4)
# Create data with date
df = pd.DataFrame(random,
index=dates_d,
columns=list('ABCD'))
df.head(3)

                   A         B         C         D
2020-01-01 -0.213744  1.524269  0.663925  0.329323
2020-01-02 -0.290518 -1.895138  0.867257 -0.718535
2020-01-03 -0.279795 -1.052890  0.314980 -1.009830

In [7]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.170539  0.096681  0.587196 -0.566988
std    0.513405  1.333536  0.198754  0.604296
min   -0.290518 -1.895138  0.314980 -1.256970
25%   -0.263283 -0.770600  0.473567 -0.939363
50%    0.013987  0.433021  0.580341 -0.723248
75%    0.641801  1.050795  0.701798 -0.193101
max    0.790409  1.524269  0.867257  0.329323

In [8]:
df1 = pd.DataFrame({'name': ['John', 'Smith','Paul'], 'Age': ['25', '30', '50']}, index=[0, 1, 2])
df2 = pd.DataFrame({'name': ['Adam', 'Smith' ], 'Age': ['26', '11']}, index=[3, 4])
df_concat = pd.concat([df1,df2])
df_concat

    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26
4  Smith  11

In [9]:
df_concat.sort_values('Age')

    name Age
4  Smith  11
0   John  25
3   Adam  26
1  Smith  30
2   Paul  50

In [10]:
## Define path data
COLUMNS = ['age','workclass', 'fnlwgt', 'education', 'education_num', 'marital', 'occupation', 
           'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 
           'hours_week', 'native_country', 'label']
# path must be specified relatively notebook 
PATH = "../data/adult.data"
df_train = pd.read_csv(PATH, skipinitialspace=True, names = COLUMNS, index_col=False)
df_train.shape

(32561, 15)

In [11]:
df_train.groupby(['label']).mean()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_week
label,,,,,,
<=50K,36.783738,190340.86517,9.595065,148.752468,53.142921,38.840210
>50K,44.249841,188005.00000,11.611657,4006.142456,195.001530,45.473026

In [12]:
df_train.groupby(['label'])['age'].min()

label
<=50K    17
>50K     19
Name: age, dtype: int64

In [13]:
df_train.groupby(['label', 'marital'])['capital_gain'].max()

label  marital
<=50K  Divorced                 34095
       Married-AF-spouse         2653
       Married-civ-spouse       41310
       Married-spouse-absent     6849
       Never-married            34095
       Separated                 7443
       Widowed                   6849
>50K   Divorced                 99999
       Married-AF-spouse         7298
       Married-civ-spouse       99999
       Married-spouse-absent    99999
       Never-married            99999
       Separated                99999
       Widowed                  99999
Name: capital_gain, dtype: int64

In [25]:
%matplotlib inline
df_plot = df_train.groupby(['label', 'marital'])['capital_gain'].mean().unstack()
df_plot

marital,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
label,,,,,,,
<=50K,140.544724,204.076923,219.249517,106.559896,99.052492,117.190824,149.811674
>50K,5781.812095,729.800000,3678.163927,6836.647059,6137.576375,6614.727273,5071.117647